XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/psram_reg.h
/**
  ******************************************************************************
  * @file    psram_reg.h
  * @version V1.0
  * @date    2021-03-17
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __PSRAM_REG_H__
#define __PSRAM_REG_H__

#include "bl606p.h"

/* 0x0 : psram_configure */
#define PSRAM_CONFIGURE_OFFSET        (0x0)
#define PSRAM_REG_VENDOR_SEL          PSRAM_REG_VENDOR_SEL
#define PSRAM_REG_VENDOR_SEL_POS      (0U)
#define PSRAM_REG_VENDOR_SEL_LEN      (3U)
#define PSRAM_REG_VENDOR_SEL_MSK      (((1U << PSRAM_REG_VENDOR_SEL_LEN) - 1) << PSRAM_REG_VENDOR_SEL_POS)
#define PSRAM_REG_VENDOR_SEL_UMSK     (~(((1U << PSRAM_REG_VENDOR_SEL_LEN) - 1) << PSRAM_REG_VENDOR_SEL_POS))
#define PSRAM_REG_AP_MR               PSRAM_REG_AP_MR
#define PSRAM_REG_AP_MR_POS           (4U)
#define PSRAM_REG_AP_MR_LEN           (3U)
#define PSRAM_REG_AP_MR_MSK           (((1U << PSRAM_REG_AP_MR_LEN) - 1) << PSRAM_REG_AP_MR_POS)
#define PSRAM_REG_AP_MR_UMSK          (~(((1U << PSRAM_REG_AP_MR_LEN) - 1) << PSRAM_REG_AP_MR_POS))
#define PSRAM_REG_WB_REG_SEL          PSRAM_REG_WB_REG_SEL
#define PSRAM_REG_WB_REG_SEL_POS      (8U)
#define PSRAM_REG_WB_REG_SEL_LEN      (3U)
#define PSRAM_REG_WB_REG_SEL_MSK      (((1U << PSRAM_REG_WB_REG_SEL_LEN) - 1) << PSRAM_REG_WB_REG_SEL_POS)
#define PSRAM_REG_WB_REG_SEL_UMSK     (~(((1U << PSRAM_REG_WB_REG_SEL_LEN) - 1) << PSRAM_REG_WB_REG_SEL_POS))
#define PSRAM_REG_CONFIG_W_PUSLE      PSRAM_REG_CONFIG_W_PUSLE
#define PSRAM_REG_CONFIG_W_PUSLE_POS  (12U)
#define PSRAM_REG_CONFIG_W_PUSLE_LEN  (1U)
#define PSRAM_REG_CONFIG_W_PUSLE_MSK  (((1U << PSRAM_REG_CONFIG_W_PUSLE_LEN) - 1) << PSRAM_REG_CONFIG_W_PUSLE_POS)
#define PSRAM_REG_CONFIG_W_PUSLE_UMSK (~(((1U << PSRAM_REG_CONFIG_W_PUSLE_LEN) - 1) << PSRAM_REG_CONFIG_W_PUSLE_POS))
#define PSRAM_REG_CONFIG_R_PUSLE      PSRAM_REG_CONFIG_R_PUSLE
#define PSRAM_REG_CONFIG_R_PUSLE_POS  (13U)
#define PSRAM_REG_CONFIG_R_PUSLE_LEN  (1U)
#define PSRAM_REG_CONFIG_R_PUSLE_MSK  (((1U << PSRAM_REG_CONFIG_R_PUSLE_LEN) - 1) << PSRAM_REG_CONFIG_R_PUSLE_POS)
#define PSRAM_REG_CONFIG_R_PUSLE_UMSK (~(((1U << PSRAM_REG_CONFIG_R_PUSLE_LEN) - 1) << PSRAM_REG_CONFIG_R_PUSLE_POS))
#define PSRAM_STS_CONFIG_W_DONE       PSRAM_STS_CONFIG_W_DONE
#define PSRAM_STS_CONFIG_W_DONE_POS   (14U)
#define PSRAM_STS_CONFIG_W_DONE_LEN   (1U)
#define PSRAM_STS_CONFIG_W_DONE_MSK   (((1U << PSRAM_STS_CONFIG_W_DONE_LEN) - 1) << PSRAM_STS_CONFIG_W_DONE_POS)
#define PSRAM_STS_CONFIG_W_DONE_UMSK  (~(((1U << PSRAM_STS_CONFIG_W_DONE_LEN) - 1) << PSRAM_STS_CONFIG_W_DONE_POS))
#define PSRAM_STS_CONFIG_R_DONE       PSRAM_STS_CONFIG_R_DONE
#define PSRAM_STS_CONFIG_R_DONE_POS   (15U)
#define PSRAM_STS_CONFIG_R_DONE_LEN   (1U)
#define PSRAM_STS_CONFIG_R_DONE_MSK   (((1U << PSRAM_STS_CONFIG_R_DONE_LEN) - 1) << PSRAM_STS_CONFIG_R_DONE_POS)
#define PSRAM_STS_CONFIG_R_DONE_UMSK  (~(((1U << PSRAM_STS_CONFIG_R_DONE_LEN) - 1) << PSRAM_STS_CONFIG_R_DONE_POS))
#define PSRAM_REG_CONFIG_REQ          PSRAM_REG_CONFIG_REQ
#define PSRAM_REG_CONFIG_REQ_POS      (16U)
#define PSRAM_REG_CONFIG_REQ_LEN      (1U)
#define PSRAM_REG_CONFIG_REQ_MSK      (((1U << PSRAM_REG_CONFIG_REQ_LEN) - 1) << PSRAM_REG_CONFIG_REQ_POS)
#define PSRAM_REG_CONFIG_REQ_UMSK     (~(((1U << PSRAM_REG_CONFIG_REQ_LEN) - 1) << PSRAM_REG_CONFIG_REQ_POS))
#define PSRAM_REG_CONFIG_GNT          PSRAM_REG_CONFIG_GNT
#define PSRAM_REG_CONFIG_GNT_POS      (17U)
#define PSRAM_REG_CONFIG_GNT_LEN      (1U)
#define PSRAM_REG_CONFIG_GNT_MSK      (((1U << PSRAM_REG_CONFIG_GNT_LEN) - 1) << PSRAM_REG_CONFIG_GNT_POS)
#define PSRAM_REG_CONFIG_GNT_UMSK     (~(((1U << PSRAM_REG_CONFIG_GNT_LEN) - 1) << PSRAM_REG_CONFIG_GNT_POS))
#define PSRAM_REG_X16_MODE            PSRAM_REG_X16_MODE
#define PSRAM_REG_X16_MODE_POS        (18U)
#define PSRAM_REG_X16_MODE_LEN        (1U)
#define PSRAM_REG_X16_MODE_MSK        (((1U << PSRAM_REG_X16_MODE_LEN) - 1) << PSRAM_REG_X16_MODE_POS)
#define PSRAM_REG_X16_MODE_UMSK       (~(((1U << PSRAM_REG_X16_MODE_LEN) - 1) << PSRAM_REG_X16_MODE_POS))
#define PSRAM_REG_WB_HYPER3           PSRAM_REG_WB_HYPER3
#define PSRAM_REG_WB_HYPER3_POS       (19U)
#define PSRAM_REG_WB_HYPER3_LEN       (1U)
#define PSRAM_REG_WB_HYPER3_MSK       (((1U << PSRAM_REG_WB_HYPER3_LEN) - 1) << PSRAM_REG_WB_HYPER3_POS)
#define PSRAM_REG_WB_HYPER3_UMSK      (~(((1U << PSRAM_REG_WB_HYPER3_LEN) - 1) << PSRAM_REG_WB_HYPER3_POS))
#define PSRAM_REG_PCK_S_DIV           PSRAM_REG_PCK_S_DIV
#define PSRAM_REG_PCK_S_DIV_POS       (20U)
#define PSRAM_REG_PCK_S_DIV_LEN       (3U)
#define PSRAM_REG_PCK_S_DIV_MSK       (((1U << PSRAM_REG_PCK_S_DIV_LEN) - 1) << PSRAM_REG_PCK_S_DIV_POS)
#define PSRAM_REG_PCK_S_DIV_UMSK      (~(((1U << PSRAM_REG_PCK_S_DIV_LEN) - 1) << PSRAM_REG_PCK_S_DIV_POS))
#define PSRAM_REG_CLKN_FREE           PSRAM_REG_CLKN_FREE
#define PSRAM_REG_CLKN_FREE_POS       (23U)
#define PSRAM_REG_CLKN_FREE_LEN       (1U)
#define PSRAM_REG_CLKN_FREE_MSK       (((1U << PSRAM_REG_CLKN_FREE_LEN) - 1) << PSRAM_REG_CLKN_FREE_POS)
#define PSRAM_REG_CLKN_FREE_UMSK      (~(((1U << PSRAM_REG_CLKN_FREE_LEN) - 1) << PSRAM_REG_CLKN_FREE_POS))
#define PSRAM_REG_LINEAR_BND_B        PSRAM_REG_LINEAR_BND_B
#define PSRAM_REG_LINEAR_BND_B_POS    (28U)
#define PSRAM_REG_LINEAR_BND_B_LEN    (4U)
#define PSRAM_REG_LINEAR_BND_B_MSK    (((1U << PSRAM_REG_LINEAR_BND_B_LEN) - 1) << PSRAM_REG_LINEAR_BND_B_POS)
#define PSRAM_REG_LINEAR_BND_B_UMSK   (~(((1U << PSRAM_REG_LINEAR_BND_B_LEN) - 1) << PSRAM_REG_LINEAR_BND_B_POS))

