XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/psram_reg.h
/* 0x8C : psram_intf_delay_ctrl3 */
#define PSRAM_INTF_DELAY_CTRL3_OFFSET   (0x8C)
#define PSRAM_REG_DELAY_SEL_I_ADQ1      PSRAM_REG_DELAY_SEL_I_ADQ1
#define PSRAM_REG_DELAY_SEL_I_ADQ1_POS  (0U)
#define PSRAM_REG_DELAY_SEL_I_ADQ1_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ1_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ1_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ1_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ1_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ1_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ1_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ0      PSRAM_REG_DELAY_SEL_I_ADQ0
#define PSRAM_REG_DELAY_SEL_I_ADQ0_POS  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ0_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ0_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ0_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ0_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ0_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ0_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ0_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ7      PSRAM_REG_DELAY_SEL_O_ADQ7
#define PSRAM_REG_DELAY_SEL_O_ADQ7_POS  (16U)
#define PSRAM_REG_DELAY_SEL_O_ADQ7_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ7_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ7_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ7_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ7_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ7_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ7_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ6      PSRAM_REG_DELAY_SEL_O_ADQ6
#define PSRAM_REG_DELAY_SEL_O_ADQ6_POS  (24U)
#define PSRAM_REG_DELAY_SEL_O_ADQ6_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ6_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ6_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ6_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ6_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ6_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ6_POS))

/* 0x90 : psram_intf_delay_ctrl4 */
#define PSRAM_INTF_DELAY_CTRL4_OFFSET   (0x90)
#define PSRAM_REG_DELAY_SEL_I_ADQ5      PSRAM_REG_DELAY_SEL_I_ADQ5
#define PSRAM_REG_DELAY_SEL_I_ADQ5_POS  (0U)
#define PSRAM_REG_DELAY_SEL_I_ADQ5_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ5_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ5_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ5_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ5_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ5_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ5_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ4      PSRAM_REG_DELAY_SEL_I_ADQ4
#define PSRAM_REG_DELAY_SEL_I_ADQ4_POS  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ4_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ4_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ4_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ4_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ4_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ4_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ4_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ3      PSRAM_REG_DELAY_SEL_I_ADQ3
#define PSRAM_REG_DELAY_SEL_I_ADQ3_POS  (16U)
#define PSRAM_REG_DELAY_SEL_I_ADQ3_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ3_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ3_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ3_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ3_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ3_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ3_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ2      PSRAM_REG_DELAY_SEL_I_ADQ2
#define PSRAM_REG_DELAY_SEL_I_ADQ2_POS  (24U)
#define PSRAM_REG_DELAY_SEL_I_ADQ2_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ2_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ2_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ2_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ2_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ2_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ2_POS))

/* 0x94 : psram_intf_delay_ctrl5 */
#define PSRAM_INTF_DELAY_CTRL5_OFFSET   (0x94)
#define PSRAM_REG_DELAY_SEL_I_DQS0      PSRAM_REG_DELAY_SEL_I_DQS0
#define PSRAM_REG_DELAY_SEL_I_DQS0_POS  (0U)
#define PSRAM_REG_DELAY_SEL_I_DQS0_LEN  (16U)
#define PSRAM_REG_DELAY_SEL_I_DQS0_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_DQS0_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_DQS0_POS)
#define PSRAM_REG_DELAY_SEL_I_DQS0_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_DQS0_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_DQS0_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ7      PSRAM_REG_DELAY_SEL_I_ADQ7
#define PSRAM_REG_DELAY_SEL_I_ADQ7_POS  (16U)
#define PSRAM_REG_DELAY_SEL_I_ADQ7_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ7_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ7_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ7_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ7_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ7_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ7_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ6      PSRAM_REG_DELAY_SEL_I_ADQ6
#define PSRAM_REG_DELAY_SEL_I_ADQ6_POS  (24U)
#define PSRAM_REG_DELAY_SEL_I_ADQ6_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ6_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ6_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ6_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ6_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ6_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ6_POS))

/* 0x98 : psram_intf_delay_ctrl6 */
#define PSRAM_INTF_DELAY_CTRL6_OFFSET       (0x98)
#define PSRAM_REG_DELAY_SEL_O_ADQ9          PSRAM_REG_DELAY_SEL_O_ADQ9
#define PSRAM_REG_DELAY_SEL_O_ADQ9_POS      (0U)
#define PSRAM_REG_DELAY_SEL_O_ADQ9_LEN      (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ9_MSK      (((1U << PSRAM_REG_DELAY_SEL_O_ADQ9_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ9_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ9_UMSK     (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ9_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ9_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ8          PSRAM_REG_DELAY_SEL_O_ADQ8
#define PSRAM_REG_DELAY_SEL_O_ADQ8_POS      (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ8_LEN      (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ8_MSK      (((1U << PSRAM_REG_DELAY_SEL_O_ADQ8_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ8_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ8_UMSK     (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ8_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ8_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ_OEN1      PSRAM_REG_DELAY_SEL_O_ADQ_OEN1
#define PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_POS  (16U)
#define PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ_OEN1_POS))
#define PSRAM_REG_DELAY_SEL_O_DQS1          PSRAM_REG_DELAY_SEL_O_DQS1
#define PSRAM_REG_DELAY_SEL_O_DQS1_POS      (24U)
#define PSRAM_REG_DELAY_SEL_O_DQS1_LEN      (8U)
#define PSRAM_REG_DELAY_SEL_O_DQS1_MSK      (((1U << PSRAM_REG_DELAY_SEL_O_DQS1_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_DQS1_POS)
#define PSRAM_REG_DELAY_SEL_O_DQS1_UMSK     (~(((1U << PSRAM_REG_DELAY_SEL_O_DQS1_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_DQS1_POS))

/* 0x9C : psram_intf_delay_ctrl7 */
#define PSRAM_INTF_DELAY_CTRL7_OFFSET    (0x9C)
#define PSRAM_REG_DELAY_SEL_O_ADQ13      PSRAM_REG_DELAY_SEL_O_ADQ13
#define PSRAM_REG_DELAY_SEL_O_ADQ13_POS  (0U)
#define PSRAM_REG_DELAY_SEL_O_ADQ13_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ13_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ13_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ13_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ13_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ13_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ13_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ12      PSRAM_REG_DELAY_SEL_O_ADQ12
#define PSRAM_REG_DELAY_SEL_O_ADQ12_POS  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ12_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ12_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ12_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ12_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ12_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ12_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ12_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ11      PSRAM_REG_DELAY_SEL_O_ADQ11
#define PSRAM_REG_DELAY_SEL_O_ADQ11_POS  (16U)
#define PSRAM_REG_DELAY_SEL_O_ADQ11_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ11_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ11_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ11_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ11_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ11_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ11_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ10      PSRAM_REG_DELAY_SEL_O_ADQ10
#define PSRAM_REG_DELAY_SEL_O_ADQ10_POS  (24U)
#define PSRAM_REG_DELAY_SEL_O_ADQ10_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ10_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ10_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ10_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ10_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ10_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ10_POS))

/* 0xA0 : psram_intf_delay_ctrl8 */
#define PSRAM_INTF_DELAY_CTRL8_OFFSET    (0xA0)
#define PSRAM_REG_DELAY_SEL_I_ADQ9       PSRAM_REG_DELAY_SEL_I_ADQ9
#define PSRAM_REG_DELAY_SEL_I_ADQ9_POS   (0U)
#define PSRAM_REG_DELAY_SEL_I_ADQ9_LEN   (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ9_MSK   (((1U << PSRAM_REG_DELAY_SEL_I_ADQ9_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ9_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ9_UMSK  (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ9_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ9_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ8       PSRAM_REG_DELAY_SEL_I_ADQ8
#define PSRAM_REG_DELAY_SEL_I_ADQ8_POS   (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ8_LEN   (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ8_MSK   (((1U << PSRAM_REG_DELAY_SEL_I_ADQ8_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ8_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ8_UMSK  (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ8_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ8_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ15      PSRAM_REG_DELAY_SEL_O_ADQ15
#define PSRAM_REG_DELAY_SEL_O_ADQ15_POS  (16U)
#define PSRAM_REG_DELAY_SEL_O_ADQ15_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ15_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ15_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ15_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ15_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ15_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ15_POS))
#define PSRAM_REG_DELAY_SEL_O_ADQ14      PSRAM_REG_DELAY_SEL_O_ADQ14
#define PSRAM_REG_DELAY_SEL_O_ADQ14_POS  (24U)
#define PSRAM_REG_DELAY_SEL_O_ADQ14_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_ADQ14_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_ADQ14_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ14_POS)
#define PSRAM_REG_DELAY_SEL_O_ADQ14_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_ADQ14_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_ADQ14_POS))

/* 0xA4 : psram_intf_delay_ctrl9 */
#define PSRAM_INTF_DELAY_CTRL9_OFFSET    (0xA4)
#define PSRAM_REG_DELAY_SEL_I_ADQ13      PSRAM_REG_DELAY_SEL_I_ADQ13
#define PSRAM_REG_DELAY_SEL_I_ADQ13_POS  (0U)
#define PSRAM_REG_DELAY_SEL_I_ADQ13_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ13_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ13_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ13_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ13_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ13_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ13_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ12      PSRAM_REG_DELAY_SEL_I_ADQ12
#define PSRAM_REG_DELAY_SEL_I_ADQ12_POS  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ12_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ12_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ12_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ12_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ12_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ12_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ12_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ11      PSRAM_REG_DELAY_SEL_I_ADQ11
#define PSRAM_REG_DELAY_SEL_I_ADQ11_POS  (16U)
#define PSRAM_REG_DELAY_SEL_I_ADQ11_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ11_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ11_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ11_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ11_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ11_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ11_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ10      PSRAM_REG_DELAY_SEL_I_ADQ10
#define PSRAM_REG_DELAY_SEL_I_ADQ10_POS  (24U)
#define PSRAM_REG_DELAY_SEL_I_ADQ10_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ10_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ10_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ10_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ10_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ10_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ10_POS))

/* 0xA8 : psram_intf_delay_ctrlA */
#define PSRAM_INTF_DELAY_CTRLA_OFFSET    (0xA8)
#define PSRAM_REG_DELAY_SEL_I_DQS1       PSRAM_REG_DELAY_SEL_I_DQS1
#define PSRAM_REG_DELAY_SEL_I_DQS1_POS   (0U)
#define PSRAM_REG_DELAY_SEL_I_DQS1_LEN   (16U)
#define PSRAM_REG_DELAY_SEL_I_DQS1_MSK   (((1U << PSRAM_REG_DELAY_SEL_I_DQS1_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_DQS1_POS)
#define PSRAM_REG_DELAY_SEL_I_DQS1_UMSK  (~(((1U << PSRAM_REG_DELAY_SEL_I_DQS1_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_DQS1_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ15      PSRAM_REG_DELAY_SEL_I_ADQ15
#define PSRAM_REG_DELAY_SEL_I_ADQ15_POS  (16U)
#define PSRAM_REG_DELAY_SEL_I_ADQ15_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ15_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ15_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ15_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ15_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ15_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ15_POS))
#define PSRAM_REG_DELAY_SEL_I_ADQ14      PSRAM_REG_DELAY_SEL_I_ADQ14
#define PSRAM_REG_DELAY_SEL_I_ADQ14_POS  (24U)
#define PSRAM_REG_DELAY_SEL_I_ADQ14_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_I_ADQ14_MSK  (((1U << PSRAM_REG_DELAY_SEL_I_ADQ14_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ14_POS)
#define PSRAM_REG_DELAY_SEL_I_ADQ14_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_I_ADQ14_LEN) - 1) << PSRAM_REG_DELAY_SEL_I_ADQ14_POS))

/* 0xAC : psram_intf_delay_ctrlB */
#define PSRAM_INTF_DELAY_CTRLB_OFFSET       (0xAC)
#define PSRAM_REG_DELAY_SEL_O_DQS_MASK      PSRAM_REG_DELAY_SEL_O_DQS_MASK
#define PSRAM_REG_DELAY_SEL_O_DQS_MASK_POS  (0U)
#define PSRAM_REG_DELAY_SEL_O_DQS_MASK_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_DQS_MASK_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_DQS_MASK_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_DQS_MASK_POS)
#define PSRAM_REG_DELAY_SEL_O_DQS_MASK_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_DQS_MASK_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_DQS_MASK_POS))
#define PSRAM_REG_DELAY_SEL_O_DQS_OEN1      PSRAM_REG_DELAY_SEL_O_DQS_OEN1
#define PSRAM_REG_DELAY_SEL_O_DQS_OEN1_POS  (8U)
#define PSRAM_REG_DELAY_SEL_O_DQS_OEN1_LEN  (8U)
#define PSRAM_REG_DELAY_SEL_O_DQS_OEN1_MSK  (((1U << PSRAM_REG_DELAY_SEL_O_DQS_OEN1_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_DQS_OEN1_POS)
#define PSRAM_REG_DELAY_SEL_O_DQS_OEN1_UMSK (~(((1U << PSRAM_REG_DELAY_SEL_O_DQS_OEN1_LEN) - 1) << PSRAM_REG_DELAY_SEL_O_DQS_OEN1_POS))

/* 0xC0 : psram_dbg_sel */
#define PSRAM_DBG_SEL_OFFSET         (0xC0)
#define PSRAM_REG_PSRAM_DBG_EN       PSRAM_REG_PSRAM_DBG_EN
#define PSRAM_REG_PSRAM_DBG_EN_POS   (0U)
#define PSRAM_REG_PSRAM_DBG_EN_LEN   (1U)
#define PSRAM_REG_PSRAM_DBG_EN_MSK   (((1U << PSRAM_REG_PSRAM_DBG_EN_LEN) - 1) << PSRAM_REG_PSRAM_DBG_EN_POS)
#define PSRAM_REG_PSRAM_DBG_EN_UMSK  (~(((1U << PSRAM_REG_PSRAM_DBG_EN_LEN) - 1) << PSRAM_REG_PSRAM_DBG_EN_POS))
#define PSRAM_REG_PSRAM_DBG_SEL      PSRAM_REG_PSRAM_DBG_SEL
#define PSRAM_REG_PSRAM_DBG_SEL_POS  (4U)
#define PSRAM_REG_PSRAM_DBG_SEL_LEN  (4U)
#define PSRAM_REG_PSRAM_DBG_SEL_MSK  (((1U << PSRAM_REG_PSRAM_DBG_SEL_LEN) - 1) << PSRAM_REG_PSRAM_DBG_SEL_POS)
#define PSRAM_REG_PSRAM_DBG_SEL_UMSK (~(((1U << PSRAM_REG_PSRAM_DBG_SEL_LEN) - 1) << PSRAM_REG_PSRAM_DBG_SEL_POS))

/* 0xF0 : psram_dummy_reg */
#define PSRAM_DUMMY_REG_OFFSET         (0xF0)
#define PSRAM_REG_PSRAM_DUMMY_REG      PSRAM_REG_PSRAM_DUMMY_REG
#define PSRAM_REG_PSRAM_DUMMY_REG_POS  (0U)
#define PSRAM_REG_PSRAM_DUMMY_REG_LEN  (32U)
#define PSRAM_REG_PSRAM_DUMMY_REG_MSK  (((1U << PSRAM_REG_PSRAM_DUMMY_REG_LEN) - 1) << PSRAM_REG_PSRAM_DUMMY_REG_POS)
#define PSRAM_REG_PSRAM_DUMMY_REG_UMSK (~(((1U << PSRAM_REG_PSRAM_DUMMY_REG_LEN) - 1) << PSRAM_REG_PSRAM_DUMMY_REG_POS))

/* 0xF4 : psram_timeout_reg */
#define PSRAM_TIMEOUT_REG_OFFSET   (0xF4)
#define PSRAM_REG_TIMEOUT_EN       PSRAM_REG_TIMEOUT_EN
#define PSRAM_REG_TIMEOUT_EN_POS   (0U)
#define PSRAM_REG_TIMEOUT_EN_LEN   (1U)
#define PSRAM_REG_TIMEOUT_EN_MSK   (((1U << PSRAM_REG_TIMEOUT_EN_LEN) - 1) << PSRAM_REG_TIMEOUT_EN_POS)
#define PSRAM_REG_TIMEOUT_EN_UMSK  (~(((1U << PSRAM_REG_TIMEOUT_EN_LEN) - 1) << PSRAM_REG_TIMEOUT_EN_POS))
#define PSRAM_REG_TIMEOUT_CLR      PSRAM_REG_TIMEOUT_CLR
#define PSRAM_REG_TIMEOUT_CLR_POS  (1U)
#define PSRAM_REG_TIMEOUT_CLR_LEN  (1U)
#define PSRAM_REG_TIMEOUT_CLR_MSK  (((1U << PSRAM_REG_TIMEOUT_CLR_LEN) - 1) << PSRAM_REG_TIMEOUT_CLR_POS)
#define PSRAM_REG_TIMEOUT_CLR_UMSK (~(((1U << PSRAM_REG_TIMEOUT_CLR_LEN) - 1) << PSRAM_REG_TIMEOUT_CLR_POS))
#define PSRAM_STS_TIMEOUT          PSRAM_STS_TIMEOUT
#define PSRAM_STS_TIMEOUT_POS      (2U)
#define PSRAM_STS_TIMEOUT_LEN      (1U)
#define PSRAM_STS_TIMEOUT_MSK      (((1U << PSRAM_STS_TIMEOUT_LEN) - 1) << PSRAM_STS_TIMEOUT_POS)
#define PSRAM_STS_TIMEOUT_UMSK     (~(((1U << PSRAM_STS_TIMEOUT_LEN) - 1) << PSRAM_STS_TIMEOUT_POS))
#define PSRAM_REG_TIMEOUT_CNT      PSRAM_REG_TIMEOUT_CNT
#define PSRAM_REG_TIMEOUT_CNT_POS  (16U)
#define PSRAM_REG_TIMEOUT_CNT_LEN  (12U)
#define PSRAM_REG_TIMEOUT_CNT_MSK  (((1U << PSRAM_REG_TIMEOUT_CNT_LEN) - 1) << PSRAM_REG_TIMEOUT_CNT_POS)
#define PSRAM_REG_TIMEOUT_CNT_UMSK (~(((1U << PSRAM_REG_TIMEOUT_CNT_LEN) - 1) << PSRAM_REG_TIMEOUT_CNT_POS))

/* 0x100 : psram_rough_delay_ctrl0 */
#define PSRAM_ROUGH_DELAY_CTRL0_OFFSET      (0x100)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN0      PSRAM_REG_ROUGH_SEL_O_DQS_OEN0
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_POS)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS_OEN0_POS))
#define PSRAM_REG_ROUGH_SEL_O_CEB           PSRAM_REG_ROUGH_SEL_O_CEB
#define PSRAM_REG_ROUGH_SEL_O_CEB_POS       (8U)
#define PSRAM_REG_ROUGH_SEL_O_CEB_LEN       (8U)
#define PSRAM_REG_ROUGH_SEL_O_CEB_MSK       (((1U << PSRAM_REG_ROUGH_SEL_O_CEB_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_CEB_POS)
#define PSRAM_REG_ROUGH_SEL_O_CEB_UMSK      (~(((1U << PSRAM_REG_ROUGH_SEL_O_CEB_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_CEB_POS))
#define PSRAM_REG_ROUGH_SEL_O_CLK_N         PSRAM_REG_ROUGH_SEL_O_CLK_N
#define PSRAM_REG_ROUGH_SEL_O_CLK_N_POS     (16U)
#define PSRAM_REG_ROUGH_SEL_O_CLK_N_LEN     (8U)
#define PSRAM_REG_ROUGH_SEL_O_CLK_N_MSK     (((1U << PSRAM_REG_ROUGH_SEL_O_CLK_N_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_CLK_N_POS)
#define PSRAM_REG_ROUGH_SEL_O_CLK_N_UMSK    (~(((1U << PSRAM_REG_ROUGH_SEL_O_CLK_N_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_CLK_N_POS))
#define PSRAM_REG_ROUGH_SEL_O_CLK           PSRAM_REG_ROUGH_SEL_O_CLK
#define PSRAM_REG_ROUGH_SEL_O_CLK_POS       (24U)
#define PSRAM_REG_ROUGH_SEL_O_CLK_LEN       (8U)
#define PSRAM_REG_ROUGH_SEL_O_CLK_MSK       (((1U << PSRAM_REG_ROUGH_SEL_O_CLK_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_CLK_POS)
#define PSRAM_REG_ROUGH_SEL_O_CLK_UMSK      (~(((1U << PSRAM_REG_ROUGH_SEL_O_CLK_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_CLK_POS))

/* 0x104 : psram_rough_delay_ctrl1 */
#define PSRAM_ROUGH_DELAY_CTRL1_OFFSET      (0x104)
#define PSRAM_REG_ROUGH_SEL_O_ADQ1          PSRAM_REG_ROUGH_SEL_O_ADQ1
#define PSRAM_REG_ROUGH_SEL_O_ADQ1_POS      (0U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ1_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ1_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ1_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ1_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ1_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ0          PSRAM_REG_ROUGH_SEL_O_ADQ0
#define PSRAM_REG_ROUGH_SEL_O_ADQ0_POS      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ0_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ0_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ0_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ0_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ0_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0      PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN0_POS))
#define PSRAM_REG_ROUGH_SEL_O_DQS0          PSRAM_REG_ROUGH_SEL_O_DQS0
#define PSRAM_REG_ROUGH_SEL_O_DQS0_POS      (24U)
#define PSRAM_REG_ROUGH_SEL_O_DQS0_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS0_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_DQS0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS0_POS)
#define PSRAM_REG_ROUGH_SEL_O_DQS0_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_DQS0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS0_POS))

/* 0x108 : psram_rough_delay_ctrl2 */
#define PSRAM_ROUGH_DELAY_CTRL2_OFFSET  (0x108)
#define PSRAM_REG_ROUGH_SEL_O_ADQ5      PSRAM_REG_ROUGH_SEL_O_ADQ5
#define PSRAM_REG_ROUGH_SEL_O_ADQ5_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ5_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ5_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ5_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ5_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ5_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ5_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ5_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ4      PSRAM_REG_ROUGH_SEL_O_ADQ4
#define PSRAM_REG_ROUGH_SEL_O_ADQ4_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ4_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ4_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ4_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ4_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ4_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ4_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ4_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ3      PSRAM_REG_ROUGH_SEL_O_ADQ3
#define PSRAM_REG_ROUGH_SEL_O_ADQ3_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ3_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ3_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ3_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ3_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ3_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ3_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ3_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ2      PSRAM_REG_ROUGH_SEL_O_ADQ2
#define PSRAM_REG_ROUGH_SEL_O_ADQ2_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ2_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ2_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ2_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ2_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ2_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ2_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ2_POS))

