XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/psram_reg.h
/* 0x10C : psram_rough_delay_ctrl3 */
#define PSRAM_ROUGH_DELAY_CTRL3_OFFSET  (0x10C)
#define PSRAM_REG_ROUGH_SEL_I_ADQ1      PSRAM_REG_ROUGH_SEL_I_ADQ1
#define PSRAM_REG_ROUGH_SEL_I_ADQ1_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ1_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ1_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ1_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ1_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ1_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ0      PSRAM_REG_ROUGH_SEL_I_ADQ0
#define PSRAM_REG_ROUGH_SEL_I_ADQ0_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ0_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ0_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ0_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ0_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ0_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ7      PSRAM_REG_ROUGH_SEL_O_ADQ7
#define PSRAM_REG_ROUGH_SEL_O_ADQ7_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ7_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ7_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ7_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ7_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ7_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ7_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ7_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ6      PSRAM_REG_ROUGH_SEL_O_ADQ6
#define PSRAM_REG_ROUGH_SEL_O_ADQ6_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ6_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ6_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ6_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ6_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ6_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ6_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ6_POS))

/* 0x110 : psram_rough_delay_ctrl4 */
#define PSRAM_ROUGH_DELAY_CTRL4_OFFSET  (0x110)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5      PSRAM_REG_ROUGH_SEL_I_ADQ5
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ5_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ5_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ5_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ5_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ4      PSRAM_REG_ROUGH_SEL_I_ADQ4
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ4_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ4_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ4_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ4_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ3      PSRAM_REG_ROUGH_SEL_I_ADQ3
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ3_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ3_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ3_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ3_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ2      PSRAM_REG_ROUGH_SEL_I_ADQ2
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ2_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ2_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ2_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ2_POS))

/* 0x114 : psram_rough_delay_ctrl5 */
#define PSRAM_ROUGH_DELAY_CTRL5_OFFSET  (0x114)
#define PSRAM_REG_ROUGH_SEL_I_DQS0      PSRAM_REG_ROUGH_SEL_I_DQS0
#define PSRAM_REG_ROUGH_SEL_I_DQS0_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_I_DQS0_LEN  (16U)
#define PSRAM_REG_ROUGH_SEL_I_DQS0_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_DQS0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_DQS0_POS)
#define PSRAM_REG_ROUGH_SEL_I_DQS0_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_DQS0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_DQS0_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ7      PSRAM_REG_ROUGH_SEL_I_ADQ7
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ7_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ7_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ7_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ7_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ6      PSRAM_REG_ROUGH_SEL_I_ADQ6
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ6_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ6_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ6_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ6_POS))

/* 0x118 : psram_rough_delay_ctrl6 */
#define PSRAM_ROUGH_DELAY_CTRL6_OFFSET      (0x118)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9          PSRAM_REG_ROUGH_SEL_O_ADQ9
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_POS      (0U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ9_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ9_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ9_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ9_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ8          PSRAM_REG_ROUGH_SEL_O_ADQ8
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_POS      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ8_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ8_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ8_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ8_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1      PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_POS))
#define PSRAM_REG_ROUGH_SEL_O_DQS1          PSRAM_REG_ROUGH_SEL_O_DQS1
#define PSRAM_REG_ROUGH_SEL_O_DQS1_POS      (24U)
#define PSRAM_REG_ROUGH_SEL_O_DQS1_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS1_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_DQS1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS1_POS)
#define PSRAM_REG_ROUGH_SEL_O_DQS1_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_DQS1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS1_POS))

