XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/psram_reg.h
    /* 0x8C : psram_intf_delay_ctrl3 */
    union {
        struct
        {
            uint32_t reg_delay_sel_i_adq1 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq0 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq7 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq6 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl3;

    /* 0x90 : psram_intf_delay_ctrl4 */
    union {
        struct
        {
            uint32_t reg_delay_sel_i_adq5 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq4 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq3 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq2 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl4;

    /* 0x94 : psram_intf_delay_ctrl5 */
    union {
        struct
        {
            uint32_t reg_delay_sel_i_dqs0 : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq7 : 8;  /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq6 : 8;  /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl5;

    /* 0x98 : psram_intf_delay_ctrl6 */
    union {
        struct
        {
            uint32_t reg_delay_sel_o_adq9     : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq8     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq_oen1 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_dqs1     : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl6;

    /* 0x9C : psram_intf_delay_ctrl7 */
    union {
        struct
        {
            uint32_t reg_delay_sel_o_adq13 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq12 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq11 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq10 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl7;

    /* 0xA0 : psram_intf_delay_ctrl8 */
    union {
        struct
        {
            uint32_t reg_delay_sel_i_adq9  : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq8  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq15 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq14 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl8;

    /* 0xA4 : psram_intf_delay_ctrl9 */
    union {
        struct
        {
            uint32_t reg_delay_sel_i_adq13 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq12 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq11 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq10 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl9;

    /* 0xA8 : psram_intf_delay_ctrlA */
    union {
        struct
        {
            uint32_t reg_delay_sel_i_dqs1  : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq15 : 8;  /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq14 : 8;  /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrlA;

    /* 0xAC : psram_intf_delay_ctrlB */
    union {
        struct
        {
            uint32_t reg_delay_sel_o_dqs_mask : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_dqs_oen1 : 8;  /* [15: 8],        r/w,        0x0 */
            uint32_t reserved_16_31           : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_intf_delay_ctrlB;

    /* 0xb0  reserved */
    uint8_t RESERVED0xb0[16];

    /* 0xC0 : psram_dbg_sel */
    union {
        struct
        {
            uint32_t reg_psram_dbg_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3      : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_psram_dbg_sel : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_dbg_sel;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[44];

    /* 0xF0 : psram_dummy_reg */
    union {
        struct
        {
            uint32_t reg_psram_dummy_reg : 32; /* [31: 0],        r/w, 0xffff0000 */
        } BF;
        uint32_t WORD;
    } psram_dummy_reg;

    /* 0xF4 : psram_timeout_reg */
    union {
        struct
        {
            uint32_t reg_timeout_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_timeout_clr : 1;  /* [    1],        r/w,        0x0 */
            uint32_t sts_timeout     : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_15   : 13; /* [15: 3],       rsvd,        0x0 */
            uint32_t reg_timeout_cnt : 12; /* [27:16],        r/w,      0x100 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_timeout_reg;

    /* 0xf8  reserved */
    uint8_t RESERVED0xf8[8];

    /* 0x100 : psram_rough_delay_ctrl0 */
    union {
        struct
        {
            uint32_t reg_rough_sel_o_dqs_oen0 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_ceb      : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_clk_n    : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_clk      : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl0;

    /* 0x104 : psram_rough_delay_ctrl1 */
    union {
        struct
        {
            uint32_t reg_rough_sel_o_adq1     : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq0     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq_oen0 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_dqs0     : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl1;

    /* 0x108 : psram_rough_delay_ctrl2 */
    union {
        struct
        {
            uint32_t reg_rough_sel_o_adq5 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq4 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq3 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq2 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl2;

    /* 0x10C : psram_rough_delay_ctrl3 */
    union {
        struct
        {
            uint32_t reg_rough_sel_i_adq1 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq0 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq7 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq6 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl3;

    /* 0x110 : psram_rough_delay_ctrl4 */
    union {
        struct
        {
            uint32_t reg_rough_sel_i_adq5 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq4 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq3 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq2 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl4;

