XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/psram_reg.h
    /* 0x114 : psram_rough_delay_ctrl5 */
    union {
        struct
        {
            uint32_t reg_rough_sel_i_dqs0 : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq7 : 8;  /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq6 : 8;  /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl5;

    /* 0x118 : psram_rough_delay_ctrl6 */
    union {
        struct
        {
            uint32_t reg_rough_sel_o_adq9     : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq8     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq_oen1 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_dqs1     : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl6;

    /* 0x11C : psram_rough_delay_ctrl7 */
    union {
        struct
        {
            uint32_t reg_rough_sel_o_adq13 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq12 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq11 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq10 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl7;

    /* 0x120 : psram_rough_delay_ctrl8 */
    union {
        struct
        {
            uint32_t reg_rough_sel_i_adq9  : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq8  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq15 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_adq14 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl8;

    /* 0x124 : psram_rough_delay_ctrl9 */
    union {
        struct
        {
            uint32_t reg_rough_sel_i_adq13 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq12 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq11 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq10 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrl9;

    /* 0x128 : psram_rough_delay_ctrlA */
    union {
        struct
        {
            uint32_t reg_rough_sel_i_dqs1  : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq15 : 8;  /* [23:16],        r/w,        0x0 */
            uint32_t reg_rough_sel_i_adq14 : 8;  /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrlA;

    /* 0x12C : psram_rough_delay_ctrlB */
    union {
        struct
        {
            uint32_t reg_rough_sel_o_dqs_mask : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_rough_sel_o_dqs_oen1 : 8;  /* [15: 8],        r/w,        0x0 */
            uint32_t reserved_16_31           : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } psram_rough_delay_ctrlB;
};

typedef volatile struct psram_reg psram_reg_t;

#endif /* __PSRAM_REG_H__ */
